tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23301;

boundaryField
{

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    side
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inlet
    {
        type                fixedValue;
        value               uniform 0;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type                totalFlowRateAdvectiveDiffusive;
        phi                 phi;
        rho                 rho;
        massFluxFraction    0.0;
        value               $internalField;
    }

}


// ************************************************************************* //
